"""
Напишите программу, которая выводит на экран следующий текст:

Здравствуй, мир!
Примечание 1. Проверяющая система будет сравнивать результат вашей программы и правильный ответ посимвольно. Это означает, что выводить нужно ровно такую строку, которая указана в условии задачи.

Примечание 2. Проверяющая система пользуется стандартным выводом (используйте команду print()).
"""

print("Здравствуй, мир!")
