"""
Напишите программу, которая принимает через стандартный поток ввода (команда input()) три строки,
а затем выводит их в обратной последовательности, каждую на отдельной строчке.

Формат входных данных
На вход программе подается три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введенные строки в обратной последовательности, каждую на отдельной строке.

Примечание 1. Для считывания текста используйте команду input(), для печати текста на экране используйте команду print().

Примечание 2. Обратите внимание на то, что ваша программа прогоняется сразу на нескольких тестах.
Поэтому решение должно быть универсальным, то есть оно должно выводить текст исходя из входных данных, которые поступают вашей программе на вход.
"""

name_1 = input()
name_2 = input()
name_3 = input()
print(name_3)
print(name_2)
print(name_1)
