"""
Напишите программу, которая находит полное число метров по заданному числу сантиметров.
"""

sm = int(input())
m = 100
print(sm // m)