"""
Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке.
Первое число вводит пользователь, остальные числа вы должны сами вычислять в программе.
"""

a = int(input())
print(a)
print(a + 1)
print(a + 2)
