"""
Напишите программу, которая считывает три целых числа и выводит на экран их сумму.
Каждое число записано в отдельной строке.
"""

a = int(input())
b = int(input())
c = int(input())
print(a + b + c)
