"""
Напишите программу, вычисляющую объём куба и площадь его полной поверхности по введенному значению длины ребра.
"""

num1 = int(input())
print("Объем =", num1 * num1 * num1)
print("Площадь полной поверхности =", 6 * num1 * num1)
