"""
Напишите программу, которая считает стоимость трёх компьютеров, состоящих из монитора, системного блока, клавиатуры и мыши.
"""

a = int(input())
b = int(input())
c = int(input())
d = int(input())
f = a + b + c + d
print(f * 3)
