"""
Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя – и выводит фразу:

Hello <введённое имя> <введённая фамилия>! You have just delved into Python
"""

first_name = input()
second_name = input()

print("Hello", first_name, second_name + "!", "You have just delved into Python")
