"""
Напишите программу, которая считывает одну строку,

после чего выводит «YES» (без кавычек), если во введённой строке есть подстрока «синий», или «NO» (без кавычек) в противном случае.
"""

a = input()

if "синий" in a:
    print("YES")
else:
    print("NO")
