"""
Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.

S = 1/2 * a * b
"""

a = float(input())
b = float(input())

S = 1 / 2 * a * b

print(S)
