"""
Дано положительное действительное число. Выведите его дробную часть.
"""

a = float(input())

s = a % 1

print(s)
