"""
Напишите программу которая просит пользователя ввести его возраст и страну проживания
И выводит следующий текст на эркан: Мне <возраст> лет. Я живу в <страна>.
"""

age = input("Ваш возраст: ")
country = input("Страна проживания: ")

print("Мне " + age + " лет. Я вижу в " + country + ".")
