# Напишите программу, которая выводит сумму двух введенных чисел

number_1 = input("Number 1: ")
number_2 = input("Number 2: ")

result = int(number_1) + int(number_2)
print(number_1 + " + " + number_2 + " = " + str(result))
